In [2]:
import seaborn as sns
df = sns.load_dataset("planets") #veri seti yükleme

In [3]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [4]:
df.head() #veri seti başlangıcı

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [5]:
df.shape #boyut

(1035, 6)

In [6]:
df.mean() #ortalama

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [7]:
df["mass"].mean() #satır ortalaması

2.6381605847953233

In [8]:
df["mass"].count() #satır toplamı

513

In [9]:
df["mass"].min() #satır min

0.0036

In [10]:
df["mass"].max() #satır max

25.0

In [11]:
df["mass"].std() #standart sapma

3.8186166509616046

In [12]:
df["mass"].var() #varyans hesabı

14.58183312700122

In [13]:
df.describe() #sütunlar için istatistiksel veriler

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [14]:
df.describe().T #özet bilgiler

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [15]:
df.dropna().describe().T #eksik veriler, silinir ve istatistik yapılır

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [17]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],'veri':[10,11,52,23,43,55]})

In [18]:
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [19]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [20]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [21]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [22]:
df[("method")].head(50)

0               Radial Velocity
1               Radial Velocity
2               Radial Velocity
3               Radial Velocity
4               Radial Velocity
5               Radial Velocity
6               Radial Velocity
7               Radial Velocity
8               Radial Velocity
9               Radial Velocity
10              Radial Velocity
11              Radial Velocity
12              Radial Velocity
13              Radial Velocity
14              Radial Velocity
15              Radial Velocity
16              Radial Velocity
17              Radial Velocity
18              Radial Velocity
19              Radial Velocity
20              Radial Velocity
21              Radial Velocity
22              Radial Velocity
23              Radial Velocity
24              Radial Velocity
25              Radial Velocity
26              Radial Velocity
27              Radial Velocity
28              Radial Velocity
29                      Imaging
30                      Imaging
31                      Imaging
32    Eclipse Timing Variations
33                      Imaging
34                      Imaging
35                      Imaging
36                      Imaging
37    Eclipse Timing Variations
38    Eclipse Timing Variations
39    Eclipse Timing Variations
40    Eclipse Timing Variations
41    Eclipse Timing Variations
42    Eclipse Timing Variations
43    Eclipse Timing Variations
44    Eclipse Timing Variations
45              Radial Velocity
46              Radial Velocity
47                      Imaging
48              Radial Velocity
49              Radial Velocity
Name: method, dtype: object

In [23]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

İleri Toplulaştırma

In [25]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],'degisken1':[10,23,33,22,11,99],'degisken2':[100,253,333,262,111,969]})

In [26]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [27]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [29]:
import numpy as np
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [31]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

Dış Veri Okumak

In [32]:
#Eğer aşağıdaki dosyalar var ise çalışır, yok ise hata verir
pd.read_csv("diabete.csv")
pd.read_excel("dosya.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'diabete.csv'